<template>
  <div>
    <h1>Страница 1: Общая информация</h1>
    <h3>Тема: Одностраничные приложения (SPA)</h3>
    <p>SPA (Single Page Application) — это веб-приложение, которое загружает одну HTML-страницу и динамически обновляет её при взаимодействии с пользователем.</p>
    <p>В этой лабораторной работе мы используем фреймворк Vue 3 для разделения приложения на компоненты, а также менеджер состояний Pinia для хранения данных. Это помогает избавиться от проблемы проброса пропсов через всё дерево компонентов (props drilling).</p>
  </div>
</template>